# SetDistanceToTargetCover Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarConstraint..::..SetDistanceToTargetCover Method
RebarConstraint Class See Also
---
Sets the distance from the RebarConstrainedHandle to the target Host Cover Element surface. The RebarConstraintType of the RebarConstraint must be 'ToCover.'
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public void SetDistanceToTargetCover(
	double distanceToTargetCover
)
```

Visual Basic
---
```text
Public Sub SetDistanceToTargetCover ( _
	distanceToTargetCover As Double _
)
```

Visual C++
---
```text
public:
void SetDistanceToTargetCover(
	double distanceToTargetCover
)
```

# ### Parameters
distanceToTargetCover
    Type: System..::..Double The distance is given as an offset value, the sign of which depends on Host Cover direction.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The given value for distanceToTargetCover must be no more than 30000 feet in absolute value. |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToCover.' |

# See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace